api/controllers/MController.php

    public function  init()
    {

        Activity::updateAll(['status'=>2],['and',['status'=>1],['<=','end_time',time()]]);
        Activity::updateAll(['status'=>2],['and',['status'=>3],['<=','end_time',time()]]);
---
UPDATE `zs_activity` SET `status`='2' WHERE (`status`=1) AND (`end_time` <= 1719479939)
UPDATE `zs_activity` SET `status`='2' WHERE (`status`=3) AND (`end_time` <= 1720399847)