backend/models/Config.php

    public function info($name=NULL)
    {
        $config = Config::find()->where(['name'=>$name])->one();
---
SELECT * FROM `zs_config` WHERE `name`='WX_APPID2'