backend/models/SetImage.php

SELECT * FROM `zs_set_images` WHERE (`type`=1) AND (`language`='zh-CN') ORDER BY `sort`, `id` DESC
---
    public static function getList($where,$limit=0){
        if($limit>0){
            $model=SetImage::find()->where($where)->andWhere(['language'=>Yii::$app->language])->limit($limit)->orderBy('sort asc,id desc')->all();
        }else{
            $model=SetImage::find()->where($where)->andWhere(['language'=>Yii::$app->language])->orderBy('sort asc,id desc')->all();