backend/api/common/HomeAction.php

    protected function runAction()
    {



        $banner=SetImage::getList(['type'=>1]);
        $data_banner=[];
        foreach ($banner as $k=>$v){
            $data_banner[]=[
                'image'=>CommonFunction::setImg($v['image'])
            ];
        }
        $data_activity=[];
        $activity=Activity::find()->where(['is_index'=>1])->orderBy('sort asc,id desc')->all();
        foreach ($activity as $k=>$v){
            if($v['price']==0){
                $v['price']='公益免费';
            }
            $data_activity[]=[
                'id'=>$v['id'],
                'title'=>$v['title'],
                'start_time'=>date('m-d H:i',$v['start_time']),
                'end_time'=>date('m-d H:i',$v['end_time']),
                'image'=>CommonFunction::setImg($v['image']),
                'number'=>$v['number'],
                'status'=>$v['status'],
                'address'=>$v['address'],
                'price'=>$v['price'],
                'now_number'=>ActivityUser::find()->where(['activity_id'=>$v['id']])->count()*1,
---
SELECT * FROM `zs_activity` WHERE `is_index`=1 ORDER BY `sort`, `id` DESC
SELECT COUNT(*) FROM `zs_activity_user` WHERE `activity_id`='4'