backend/api/user/TaskAction.php

    protected function runAction()
    {



        $user_id=$this->user['id'];
        $time=strtotime(date('Y-m-01'));
        $count=UserCheck::find()->where(['user_id'=>$user_id])->andWhere(['<=','time',$time])->groupBy('time')->count()*1;
        $count1=UserCheck::find()->where(['user_id'=>$user_id,'status'=>2])->andWhere(['<=','time',$time])->groupBy('time')->count()*1;
        if($count>0){
            $number=round($count1/$count,3)*100;
        }else{
            $number=0;
        }
        $jsonData['user']=[
            'number1'=>$count1,
            'number2'=>$number,
        ];
        $jsonData['team']=[];
        $jsonData['group']=[];
        $team=UserTeam::find()->where(['user_id'=>$user_id,'type'=>1])->limit(1)->one();
        if($team){
            $total_number=UserTeam::find()->where(['team_id'=>$team['team_id'],'type'=>1])->count()*1;
            $team_number=0;
            $user1=[];
            $model1=UserCheck::find()->where(['relation_id'=>$team->team_id])->andWhere(['<=','time',$time])->all();
---
SELECT COUNT(*) FROM (SELECT * FROM `zs_user_check` WHERE (`user_id`=1) AND (`time` >= 1714492800) GROUP BY `time`) `c`
SELECT * FROM `zs_user_team` WHERE (`user_id`=1) AND (`type`=1) LIMIT 1
SELECT COUNT(*) FROM `zs_user_team` WHERE (`team_id`='3') AND (`type`=1)
SELECT * FROM `zs_user_check` WHERE (`relation_id`='3') AND (`time` >= 1714492800)


        }

        $group=UserTeam::find()->where(['user_id'=>$user_id,'type'=>2])->limit(1)->one();
---
SELECT * FROM `zs_user_team` WHERE (`user_id`=1) AND (`type`=2) LIMIT 1