backend/api/message/ListAction.php

    protected function runAction()
    {
        $page_number=$this->RequestData('page_number',10);
        $page=$this->RequestData('page',1);
        $begin=($page-1)*$page_number;
        $query=Message::find();
        $jsonData['total_pages']=ceil($query->count()/$page_number);
        $jsonData['total_count']=$query->count()*1;
        $model=$query->orderBy('sort asc,id desc')->offset($begin)->limit($page_number)->all();
        $jsonData['list']=[];
        foreach ($model as $k=>$v){
            $status=1;
            $old=UserMessage::find()->where(['user_id'=>$this->user['id'],'message_id'=>$v['id']])->limit(1)->one();
---
SELECT COUNT(*) FROM `zs_message`
SELECT * FROM `zs_message` ORDER BY `sort`, `id` DESC LIMIT 10
SELECT * FROM `zs_user_message` WHERE (`user_id` IS NULL) AND (`message_id`=1) LIMIT 1